Конфигурация/InformationRegisters/СтатусыИсходящихПлатежныхПоручений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СтатусыИсходящихПлатежныхПоручений</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПлатежныхПоручений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПлатежноеПоручениеИсходящее</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеИсходящее</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/СтатусыПлатежныхПоручений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СтатусыПлатежныхПоручений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выгружено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исполнено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проверено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/InformationRegisters/СтатусыИсходящихПлатежныхПоручений/Ext/ManagerModule.bsl
Процедура УстановитьСтатусПлатежногоПоручения(Организация, ПлатежноеПоручение, НовыйСтатус, Период = Неопределено, Отказ = Ложь, УстанавливатьБлокировку = Истина) Экспорт
	
	Попытка
		
		Если УстанавливатьБлокировку Тогда
			Блокировка				= Новый БлокировкаДанных;
			ЭлементБлокировки		= Блокировка.Добавить(Метаданные.РегистрыСведений.СтатусыИсходящихПлатежныхПоручений.ПолноеИмя());
			ЭлементБлокировки.Режим	= РежимБлокировкиДанных.Исключительный;
			
			ЭлементБлокировки.УстановитьЗначение("Организация", 				Организация);
			ЭлементБлокировки.УстановитьЗначение("ПлатежноеПоручениеИсходящее", ПлатежноеПоручение);
			                        
			Блокировка.Заблокировать();
		КонецЕсли;

		Период = ?(Период = Неопределено, ТекущаяДатаСеанса(), Период);
		
		Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СтатусыИсходящихПлатежныхПорученийСрезПоследних.Статус КАК Статус
			|ИЗ
			|	РегистрСведений.СтатусыИсходящихПлатежныхПоручений.СрезПоследних(
			|			&Период,
			|			Организация = &Организация
			|				И ПлатежноеПоручениеИсходящее = &ПлатежноеПоручение) КАК СтатусыИсходящихПлатежныхПорученийСрезПоследних");
			
		Запрос.УстановитьПараметр("Период",				Период);
		Запрос.УстановитьПараметр("ПлатежноеПоручение", ПлатежноеПоручение);
		Запрос.УстановитьПараметр("Организация", 		Организация);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		// Проверяем текущий статус
		Если Выборка.Следующий() Тогда
			Если Выборка.Статус = НовыйСтатус Тогда
				Возврат;
			ИначеЕсли Выборка.Статус = Перечисления.СтатусыПлатежныхПоручений.Исполнено Или Выборка.Статус = Перечисления.СтатусыПлатежныхПоручений.Отменено Тогда
				// Это конечные статусы, их не меняем
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Запрещено изменять статус '%1' документа %2", Выборка.Статус, ПлатежноеПоручение), ПлатежноеПоручение,,, Отказ);
				Возврат;		
			КонецЕсли;
		КонецЕсли;
				
		МенеджерЗаписи								= РегистрыСведений.СтатусыИсходящихПлатежныхПоручений.СоздатьМенеджерЗаписи();
	    МенеджерЗаписи.Период						= Период;
		МенеджерЗаписи.Организация					= Организация;
		МенеджерЗаписи.ПлатежноеПоручениеИсходящее	= ПлатежноеПоручение;
		МенеджерЗаписи.Статус						= НовыйСтатус;
		
		МенеджерЗаписи.Записать(Истина);
		
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки(), ПлатежноеПоручение,,, Отказ);
	КонецПопытки;	
		
КонецПроцедуры
